Ví dụ :
cho các dãy số được sắp xếp theo dạng cây:
                                      [8]
                                  -----/-----
                                  /         /
                                 [9]       [5]             
                                  /         /
                               ------     ------
                               /    /    /     /
                              [4]  [3]  [6]  [12]
thuật toán sẽ so sánh lần lượt 2 vị trí dưới với vị trí trên nếu vị trí dưới>vị trí trên thì đổi chỗ cho nhau

                                      [9]
                                  -----/-----
                                  /         /
                                 [8]       [6]
                                  /         /
                                ------     ------
                               /    /    /     /
                              [4]  [3]  [5]  [12]
                              
                                       [9]
                                  -----/-----
                                  /         /
                                 [8]       [12]
                                  /         /
                                ------     ------
                               /    /    /     /
                              [4]  [3]  [5]  [6]
                              
                                      [12]
                                   -----/-----
                                  /          /
                                 [8]        [9]
                                  /          /
                                ------     ------
                               /    /    /     /
                              [4]  [3]  [5]  [6]
                                
